# 7/2 это деление с остатком а 7//2 деление без остатка
# % находит остаток от деления
# команда input выводит только текст, а int превращает этот текст в число, например int(input("55")) оно вывведится как число
# print("3"*2) не уверен вообще, но наверно 6 либо 3*2 выведет
# true это правда есть еще folse ложь это помоему boal-логическое значение вроде 

# Калькулятор чаевых (сам по памяти)
check=float(input("Введите сумму счета"))
tips=int(input("Введите процент чаевых"))
amount_1=check*(tips/100) # была ошибка сразу написал amount_1=check/tips
amount_2=check+amount_1
print(f"Сумма к оплате: {round(amount_2, 2)}")
# конвентор времени (сам по памяти)
quantity=int(input("Введите кол-во минут")) # 150
hours=quantity//60 # 150//60=2 часа остается 30 минут
ost_1=quantity%60 # 150%60=30 это остаток
minutes=ost_1 # была ошибка написал сразу minutes=ost_1//60 потом сам исправил
print(f"{quantity} - это {hours} часа {minutes} минут")
# Мини-проект "Визитка"
name=input("Введите свое имя")
age=int(input("Введите ваш возраст"))
hobby=input("Какое ваше хобби?")
birthday=2026-age
print(F"Привет {name}! Ты родился в {birthday} году. Твое хобби - {hobby}. Это круто!")